Revit 2027 API
CableTrayConduitBase.IsValidEndPoints Method
 Identifies if two end points are valid.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidEndPoints(
	XYZ startPoint,
	XYZ endPoint
)
Public Shared Function IsValidEndPoints (
	startPoint As XYZ,
	endPoint As XYZ
) As Boolean
public:
static bool IsValidEndPoints(
	XYZ^ startPoint,
	XYZ^ endPoint
)
static member IsValidEndPoints :
        startPoint : XYZ *
        endPoint : XYZ -> bool
Parameters
startPoint XYZ
 The start point of the location line.
endPoint XYZ
 The end point of the location line.
Return Value
Boolean
 True if the two end points are valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The two points should not be too close.
See Also
Reference
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace